BAS BMEKZU Project/src/InformationRegisters/скEDI_ПравилаЗагрузки/скEDI_ПравилаЗагрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>скEDI_ПравилаЗагрузки</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидЭлектронногоДокумента</name>
    <type>
      <types>CatalogRef.скEDI_ВидыЭлектронныхДокументов</types>
    </type>
  </resources>
  <resources>
    <name>Схема</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидДокумента1С</name>
    <type>
      <types>EnumRef.скEDI_ВидыДокументов1С</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>НеИскатьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоПредопределенный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТиповаяСхемма</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.скEDI_Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕДРПОУВладельцаШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>225</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВерсияШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/InformationRegisters/скEDI_ПравилаЗагрузки/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не Параметры.ЗначениеКопирования.Пустой() Тогда
		Запись.ТиповаяСхемма = Ложь;
	КонецЕсли;
	Элементы.ВидДокумента1С.РежимВыбораИзСписка = Истина;
	Элементы.ВидДокумента1С.СписокВыбора.ЗагрузитьЗначения(скEDI_НастройкиПодКонфигурацию.ПолучитьМассивИспользуемыхВКонфигурацииВидовДокументов1С());
КонецПроцедуры

&НаКлиенте
Процедура ВыборШаблонаДокумента(ДанныеВыбора, ДопПараметр) Экспорт
	Если ТипЗнч(ДанныеВыбора) = Тип("Структура") Тогда
		ТекЕДРПОУВладельца = "";
		Если ДанныеВыбора.Свойство("ЕДРПОУВладельца", ТекЕДРПОУВладельца) Тогда
			Запись.ЕДРПОУВладельцаШаблона = ТекЕДРПОУВладельца;
		КонецЕсли;
		ТекКодШаблона = "";
		Если ДанныеВыбора.Свойство("КодШаблона", ТекКодШаблона) Тогда
			Запись.ИмяШаблона = ТекКодШаблона;
		КонецЕсли;
		ТекВерсия = "";
		Если ДанныеВыбора.Свойство("Версия", ТекВерсия) Тогда
			Запись.ВерсияШаблона = ТекВерсия;
		КонецЕсли;
		ТекНаименование = "";
		Если ДанныеВыбора.Свойство("Наименование", ТекНаименование) Тогда
			Запись.Наименование = ТекНаименование;
		КонецЕсли;
		
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьШаблонСПлатформыПТАХ(Команда)
	ПараметрыФормы = Новый Структура("ТекЕДРПОУВладельца, ТекИмяШаблона, ТекВерсияШаблона, Организация, ДляСозданияЭлектронныхДокументов", Запись.ЕДРПОУВладельцаШаблона, Запись.ИмяШаблона, Запись.ВерсияШаблона, Запись.Организация, Ложь);
	Если скEDI_ОбщегоНазначения.ЭтоПлатформа82() Тогда
		ВыбранныеПоляОтбора = ПолучитьФорму("ОбщаяФорма.скEDI_ФормаВыбораШаблонаДокумента", ПараметрыФормы).ОткрытьМодально();
		ВыборШаблонаДокумента(ВыбранныеПоляОтбора, Неопределено);
	Иначе
		скEDI_ОткрытиеФормБезМодальности.ОткрытьФормуВыбораШаблонаДокумента(ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры
